#### Dealing with missing values of a dataframe

#####  Missing values in a dataframe are very common. To arrive at a meaningful data for machine learning , it is important to treat the missing values .  In few cases, the missing values are imputed with data in few cases, the missing values are removed from the data frames

In [2]:
import numpy as np
import pandas as pd

In [1]:
# Make a data frame that is small and simple to estabilish the concepts of missing values

In [17]:
dic = { 'Col1': [1,2,3,np.nan,np.nan, 10 ], 'Col2':[23, np.nan, 10, 34, 56,62], 'Col3':[23, np.nan, 11, 30, np.nan,69], 
      
      "col4":[23,45,67,89,56,78]}

In [18]:
df = pd.DataFrame(data = dic)

In [19]:
df

   Col1  Col2  Col3  col4
0   1.0  23.0  23.0    23
1   2.0   NaN   NaN    45
2   3.0  10.0  11.0    67
3   NaN  34.0  30.0    89
4   NaN  56.0   NaN    56
5  10.0  62.0  69.0    78

#### To check if a datafrme has missing values  isna() , isnull()

In [29]:
#### isnull()
df.isnull().sum()

Col1    2
Col2    1
Col3    2
col4    0
dtype: int64

In [30]:
#### isnull()
df.isnull().any()

Col1     True
Col2     True
Col3     True
col4    False
dtype: bool

In [31]:
#### isnull()
df.isna().sum()

Col1    2
Col2    1
Col3    2
col4    0
dtype: int64

In [32]:
#### isna()
df.isna().any()

Col1     True
Col2     True
Col3     True
col4    False
dtype: bool

In [37]:
df['Col1'].isna().sum()

2

#### dropna() to remove missing rows and columns . dropna() method creates a separate dataframe as a result, unless we mention inplace = True. When inplace = True is given, the df is overwritten with the result

In [47]:
df.dropna(axis = 0, inplace = False)

   Col1  Col2  Col3  col4
0   1.0  23.0  23.0    23
2   3.0  10.0  11.0    67
5  10.0  62.0  69.0    78

In [42]:
df.dropna() #by default axis = 0 means the rows that have Nan are removed

   Col1  Col2  Col3  col4
0   1.0  23.0  23.0    23
2   3.0  10.0  11.0    67
5  10.0  62.0  69.0    78

In [45]:
df.dropna(axis = 1) # all the columns that are having NaN are removed

   col4
0    23
1    45
2    67
3    89
4    56
5    78

In [50]:
df.dropna(thresh = 3) # with threshold value mentioned 3, only rows that have 3 or more NaN are removed

   Col1  Col2  Col3  col4
0   1.0  23.0  23.0    23
2   3.0  10.0  11.0    67
3   NaN  34.0  30.0    89
5  10.0  62.0  69.0    78

#### fillna() : Based on the type of data fillna can be used for filling various types of values in the dataframe. For example, with a fixed value or with a mean value or with a standard deviation value etc

In [60]:
df.fillna(value = 1000) # All the NaN are filled with 1000

     Col1    Col2    Col3  col4
0     1.0    23.0    23.0    23
1     2.0  1000.0  1000.0    45
2     3.0    10.0    11.0    67
3  1000.0    34.0    30.0    89
4  1000.0    56.0  1000.0    56
5    10.0    62.0    69.0    78

In [61]:
## fillna with a mean value
df['Col1'].fillna(value = df['Col1'].mean())

0     1.0
1     2.0
2     3.0
3     4.0
4     4.0
5    10.0
Name: Col1, dtype: float64

In [62]:
df

   Col1  Col2  Col3  col4
0   1.0  23.0  23.0    23
1   2.0   NaN   NaN    45
2   3.0  10.0  11.0    67
3   NaN  34.0  30.0    89
4   NaN  56.0   NaN    56
5  10.0  62.0  69.0    78

In [63]:
## fillna of column 4 with its mean value and overwrite the df
df['col4'] = df['col4'].fillna(value = df['col4'].mean())

In [64]:
df

   Col1  Col2  Col3  col4
0   1.0  23.0  23.0    23
1   2.0   NaN   NaN    45
2   3.0  10.0  11.0    67
3   NaN  34.0  30.0    89
4   NaN  56.0   NaN    56
5  10.0  62.0  69.0    78